In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.set_option("display.max_columns", 200)

In [3]:
pd.set_option("display.width", 120)

In [4]:
people = pd.read_csv("people_data.csv")

In [5]:
history = pd.read_csv("people_employment_history.csv")

In [6]:
print("people shape:", people.shape)

people shape: (4138, 9)

In [7]:
print("history shape:", history.shape)

history shape: (4138, 16)

In [8]:
people.head()

,employee_id,gender,race,birth_date,education,location,location_city,marital_status,employment_status
0,12104572130,Female,Caucasian,1/25/1967,Master's degree,On-site,Los Angeles,Married,Full Time
1,3381966,Female,Caucasian,12/26/1990,Bachelor's degree,Remote,Washington DC,Single,Full Time
2,12868764,Male,Caucasian,5/30/1982,Bachelor's degree,On-site,San Francisco,Single,Full Time
3,17445638,Male,Caucasian,8/5/1984,Bachelor's degree,Remote,Columbus,Single,Full Time
4,19611331,Male,African American,10/4/1990,Bachelor's degree,Remote,Washington DC,Single,Full Time

In [9]:
people.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4138 entries, 0 to 4137
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   employee_id        4138 non-null   int64
 1   gender             4138 non-null   object
 2   race               4138 non-null   object
 3   birth_date         4138 non-null   object
 4   education          4040 non-null   object
 5   location           4138 non-null   object
 6   location_city      4138 non-null   object
 7   marital_status     4138 non-null   object
 8   employment_status  4138 non-null   object
dtypes: int64(1), object(8)
memory usage: 291.1+ KB

In [10]:
history.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4138 entries, 0 to 4137
Data columns (total 16 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   employee_id           4138 non-null   int64
 1   first_name            4138 non-null   object
 2   last_name             4138 non-null   object
 3   department            4138 non-null   object
 4   sub-department        4137 non-null   object
 5   first_level_manager   4137 non-null   float64
 6   second_level_manager  4030 non-null   float64
 7   third_level_manager   3678 non-null   float64
 8   fourth_level_manager  3093 non-null   float64
 9   job_level             4138 non-null   object
 10  salary                4138 non-null   int64
 11  hire_date             4138 non-null   object
 12  term_date             729 non-null    object
 13  term_type             729 non-null    object
 14  term_reason           729 non-null    object
 15  active_status         4138 non-null   int64
dtypes: float64(4), int64(3), object(9)
memory usage: 517.4+ KB

In [11]:
people.isna().sum().sort_values(ascending=False).head(15)

education            98
employee_id           0
gender                0
race                  0
birth_date            0
location              0
location_city         0
marital_status        0
employment_status     0
dtype: int64

In [12]:
history.isna().sum().sort_values(ascending=False).head(15)

term_date               3409
term_type               3409
term_reason             3409
fourth_level_manager    1045
third_level_manager      460
second_level_manager     108
sub-department             1
first_level_manager        1
employee_id                0
first_name                 0
last_name                  0
department                 0
job_level                  0
salary                     0
hire_date                  0
dtype: int64

In [13]:
history["hire_date"] = pd.to_datetime(history["hire_date"], errors="coerce")

In [14]:
history["term_date"] = pd.to_datetime(history["term_date"], errors="coerce")

In [15]:
history[["hire_date","term_date"]].head(10)

   hire_date  term_date
0 2017-06-28        NaT
1 2017-12-18        NaT
2 2012-03-28        NaT
3 2017-06-29 2019-04-03
4 2021-04-12        NaT
5 2014-07-14        NaT
6 2014-06-21 2015-04-16
7 2014-05-04        NaT
8 2018-04-13        NaT
9 2017-07-25        NaT

In [17]:
bad_dates = history[(history["term_date"].notna()) & (history["hire_date"] > history["term_date"])]
bad_dates.shape

(0, 16)

In [18]:
df = history.merge(people, on="employee_id", how="left")

In [19]:
print("joined shape:", df.shape)

joined shape: (4138, 24)

In [20]:
df.head()

,employee_id,first_name,last_name,department,sub-department,first_level_manager,second_level_manager,third_level_manager,fourth_level_manager,job_level,salary,hire_date,term_date,term_type,term_reason,active_status,gender,race,birth_date,education,location,location_city,marital_status,employment_status
0,12104572130,Kip,O'Finan,Executive,NaN,NaN,NaN,NaN,NaN,CEO,2468287,2017-06-28,NaT,NaN,NaN,1,Female,Caucasian,1/25/1967,Master's degree,On-site,Los Angeles,Married,Full Time
1,3381966,Kate,Maceur,Legal,Intellectual Property,3.278384e+09,1.490362e+09,2.591261e+09,1.210457e+10,Individual Contributor,112274,2017-12-18,NaT,NaN,NaN,1,Female,Caucasian,12/26/1990,Bachelor's degree,Remote,Washington DC,Single,Full Time
2,12868764,Bard,Kenneford,Software,Software Development,7.216768e+09,6.279119e+09,6.268712e+09,1.210457e+10,Individual Contributor,101769,2012-03-28,NaT,NaN,NaN,1,Male,Caucasian,5/30/1982,Bachelor's degree,On-site,San Francisco,Single,Full Time
3,17445638,Saw,Sogg,Marketing,Public Relations,6.725256e+09,2.884264e+09,1.949400e+09,1.210457e+10,Individual Contributor,82641,2017-06-29,2019-04-03,Voluntary,Found a better opportunity,0,Male,Caucasian,8/5/1984,Bachelor's degree,Remote,Columbus,Single,Full Time
4,19611331,Cullen,Stiell,HR,Benefits,6.064345e+09,8.377150e+09,1.210457e+10,NaN,Team Lead,69487,2021-04-12,NaT,NaN,NaN,1,Male,African American,10/4/1990,Bachelor's degree,Remote,Washington DC,Single,Full Time

In [21]:
missing_people = df[df.filter(["employee_id"]).columns].copy()

In [22]:
if "department" in df.columns:
    print("Missing people rows:", df["department"].isna().sum())

Missing people rows: 0

In [23]:
core_cols = ["employee_id", "hire_date", "term_date"]

In [24]:
other_cols = [c for c in df.columns if c not in core_cols]

In [25]:
df = df[core_cols + other_cols]

In [26]:
df.to_csv("../data/processed/people_fact_clean.csv", index=False)

In [27]:
print("Saved:", "../data/processed/people_fact_clean.csv")

Saved: ../data/processed/people_fact_clean.csv